app/Http/Controllers/Auth/AdminLoginController.php

    public function showLoginForm()
    {
        $settings = GlobalSettings::where('type', 'admin_otp');
        if ($settings->doesntExist()) {
            $settings = new GlobalSettings();
            $settings->setting_value = 1;
            $settings->type = "admin_otp";
            $settings->save();
        } else {
            $settings = $settings->first();
---
select exists(select * from `global_settings` where `type` = 'admin_otp') as `exists`
select * from `global_settings` where `type` = 'admin_otp' limit 1