app/Http/Controllers/Auth/AdminLoginController.php

    public function login(Request $request){
        //validate the form
//        $errors = new MessageBag;
        $this->validate($request, [
            'phone_number' =>'required',
            'pin' => 'required|min:4'
        ]);

        //Attempt to login
        if(Auth::guard('admin')->attempt(['phone_number' => $request->phone_number , 'password'=>$request->pin], $request->remember) || Auth::guard('admin')->attempt(['official_phone_number' => $request->phone_number , 'password'=>$request->pin], $request->remember)){
            //if Successfull then redirect to intended location

            $admin = Auth::guard('admin');

            if ($admin->user()->status == 0) {
                auth('admin')->logout();
                return back()->with('info', 'Your Account is Disabled, Contact Admin');
            }

            $id = $admin->id();
            $role_id = $admin->user()->role_id;
            $first_login = $admin->user()->first_login;

            $hubs = AdminHub::where('admin_id', $id)->pluck('hub_id')->toArray();
            $shippers = SalePersonTag::where('admin_id', $id)->where('status', 0)->pluck('user_id')->toArray();
            $assigned_admins = MultipleSaleLead::leftjoin('multiple_sale_taggings as mst', 'mst.lead_id', '=', 'multiple_sale_leads.id')
                ->leftjoin('sale_person_tags as spt', 'spt.admin_id', '=', 'mst.admin_id')
                ->where('multiple_sale_leads.admin_id', $id)
                ->where('spt.status', 0)
                ->whereNotNull('spt.user_id')->select('spt.user_id');
            if($assigned_admins->exists()) {
---
select `hub_id` from `admin_hubs` where `admin_id` = 1010
select exists(select `spt`.`user_id` from `multiple_sale_leads` left join `multiple_sale_taggings` as `mst` on `mst`.`lead_id` = `multiple_sale_leads`.`id` left join `sale_person_tags` as `spt` on `spt`.`admin_id` = `mst`.`admin_id` where `multiple_sale_leads`.`admin_id` = 1010 and `spt`.`status` = 0 and `spt`.`user_id` is not null) as `exists`
select `user_id` from `sale_person_tags` where `admin_id` = 1010 and `status` = 0

            }
            $KAE = SaleTierTag::where('kam',$id);
            if($KAE->exists()){
                $KAE = $KAE->pluck('user_id')->toArray();
---
select exists(select * from `sale_tier_tags` where `kam` = 1010) as `exists`

                //$shippers = array_unique($shippers);
            }

            $permissions = AdminRoleModulePermission::where('role_id', $role_id)->pluck('permission_id')->toArray();
            $department = AdminRole::find($role_id)->department_id;
            $sales_coordinator = SalesCommissionUser::where('user_id',$id)->whereIn('sales_commission_users.tier_id',[2,3])->exists();
---
select `permission_id` from `admin_role_module_permissions` where `role_id` = 1
select exists(select * from `sales_commission_users` where `user_id` = 1010 and `sales_commission_users`.`tier_id` in (2, 3)) as `exists`

            }
//mark login start
            $check_login = AgentReturnConfirmation::where('admin_id',$id)->where('current_date',Carbon::now()->format("Y-m-d"));
            if(!$check_login->exists()){
               $agent_role = AdminRole::leftjoin('admins as a', 'a.role_id', '=', 'admin_roles.id')
                ->where('admin_roles.department_id',3)->where('a.id',$id);
                if($agent_role->exists()){
---
select exists(select * from `agent_return_confirmations` where `admin_id` = 1010 and `current_date` = '2023-06-26') as `exists`
select exists(select * from `admin_roles` left join `admins` as `a` on `a`.`role_id` = `admin_roles`.`id` where `admin_roles`.`department_id` = 3 and `a`.`id` = 1010) as `exists`
select * from `admin_roles` where `admin_roles`.`id` = 1 limit 1