app/Http/Controllers/Admins/AdminPettyCashController.php

select exists(select * from `petty_cash_sdn_logs` where `petty_cash_statement_id` = '1') as `exists`
---
    public function sdn_log(Request $request)
    {
        $logs = PettyCashSdnLog::where('petty_cash_statement_id',$request->statement_id);
        if($logs->exists())
        {
            $logs = $logs->get();