app/Http/Controllers/Admins/AdminPettyCashController.php

select exists(select * from `cities` where `zone_id` = '1' and `hub` = 1 and `status` = 1) as `exists`
select `id`, `name` from `cities` where `zone_id` = '1' and `hub` = 1 and `status` = 1
select exists(select * from `cities` where `hub_id` is null and `status` = 1) as `exists`
---
    public function make_petty_cash_statement_get_hubs(Request $request)
    {
            $zone_id = $request->zone;
            $hubs = City::where('zone_id',$zone_id)->where('hub',1)->where('status',1);
            if($hubs->exists())
            {
                $data = $hubs->select(['id','name'])->get();

select exists(select * from `station_deposit_notes` where `id` = 65) as `exists`
select * from `station_deposit_notes` where `id` = 65 limit 1
select * from `delivery_notes` where `delivery_notes`.`id` = 98 limit 1
---
    public static function make_petty_cash_statement_get_dncc_static($sdn_id)
    {
        $sdn =  StationDepositNote::where('id',$sdn_id);
        if($sdn->exists())
        {
            $sdn = $sdn->first();
            if($sdn->sdn_type == 1)
            {
                foreach ($sdn->delivery_notes_list as $key => $dncc)
                {
                    $data[$key]['id'] = $dncc->delivery_note_id;
                    $data[$key]['text'] = str_pad($dncc->delivery_note_id, 4, '0', STR_PAD_LEFT);
                    $delivery_note = DeliveryNote::find($dncc->delivery_note_id);

select exists(select * from `admins` where `id` = '7' and `status` = 1) as `exists`
select * from `admins` where `id` = '7' and `status` = 1 limit 1
---
    public function make_petty_cash_statement_get_employee(Request $request)
    {
        $employee_id = $request->employee;
        $employee = Admin::where('id',$employee_id)->where('status',1);
        if($employee->exists())

select `petty_cash_account_title_id` from `petty_cash_account_head_account_title` inner join `petty_cash_account_titles` as `pct` on `pct`.`id` = `petty_cash_account_head_account_title`.`petty_cash_account_title_id` where `petty_cash_account_head_id` = '4' and `pct`.`status` = 1
select `id`, `name` from `petty_cash_account_titles` where `id` in (48, 58, 60, 38, 57, 55, 66)
---
    public function make_petty_cash_statement_titles(Request $request)
    {
        $account_head = $request->account_head;
        $title_ids = PettyCashAccountHeadAccountTitle::where('petty_cash_account_head_id', $account_head)->join('petty_cash_account_titles as pct', 'pct.id', '=', 'petty_cash_account_head_account_title.petty_cash_account_title_id')->where('pct.status', 1)->select('petty_cash_account_title_id')->get();

        $titles = PettyCashAccountTitle::whereIn('id', $title_ids)->select('id', 'name')->get();

select * from `cities` where `cities`.`zone_id` = 1 and `cities`.`zone_id` is not null
---
    public function advance_petty_cash_statements_index()
    {
        //        ActivityTrailController::createActivityTrailLog(Auth::id(),39);
        if (session('role_id') == 1) {
            $hubs = City::where('hub', 1)->where('status',1)->get();
        } else {
            $hubs = City::where('hub', 1)->where('status',1)->whereIn('id', session('hubs'))->get();
        }
        $zones = Zone::where('status', 1)->get();
        $statuses = AdvancePettyCashStatementStatus::all();
        return view('admin.petty_cash.advance.statements')->with(['hubs' => $hubs,'zones'=>$zones,'statuses' => $statuses]);

select * from `advance_petty_cash_statements` where `advance_petty_cash_statements`.`id` = '2' limit 1
select `id`, `name` from `petty_cash_account_heads`
---
    public function advance_add_petty_cash_statement_make_detail(Request $request,$id)
    {
        $petty = AdvancePettyCashStatement::find($id);

        if(!in_array($petty->status_id ,[0,1,2,7,6]))
        {
            return redirect()->route('admin.petty_cash.advance.statements',$id);
        }
        $head = PettyCashAccountHead::select('id', 'name')->get();
        $cost_centres = CostCentre::select('id', 'name')->get();
        $zones = Zone::where('business_category_id',1)->select('id','name')->where('status',1)->get();
        $hub_array = array();
        $city_array = array();
        $dncc_array = "";
        foreach ($zones as $zone) {
            if($zone->id == $petty->zone_id) {
                $hub_array[$zone->id] = $zone->zone_cities->where('hub', 1);
            }
        }

        $hubs = City::where('hub',1)->select('id','name')->get();

        $employees = Admin::where('trax_id','!=',null)->where('status',1)->select(['id','trax_id'])->get();
        $operation_managers = Admin::where('role_id',10)->where('status',1)->select(['id','trax_id','name'])->get();
        if (session('role_id') == 1) {
            $sdns = StationDepositNote::where('status','!=', 2)->select('id')->get();
        } else {
            $sdns = StationDepositNote::where('status','!=', 2)->whereIn('hub_id', session('hubs'))->select('id')->get();
        }

        return view('admin.petty_cash.advance.make_detail')->with(['heads' => $head, 'petty_statement' => $petty,'zones'=>$zones,'sdns'=>$sdns,'employees'=>$employees,'operation_managers'=>$operation_managers,'hubs'=> $hubs,'hub_array' => $hub_array, 'cost_centres' => $cost_centres]);