app/Http/Controllers/Admins/Attendance/AdminAttendanceController.php

    public function mark_attendance_index()
    {
        ActivityTrailController::createActivityTrailLog(Auth::id(), 432);
        $admin_id = Auth::id();
        $date = Carbon::now()->format("Y-m-d");
        $admin = Admin::find($admin_id);
        if ($admin) {
            $admin_shift = EmployeeShift::where('id', $admin->shift_id);
            if ($admin_shift->exists()) {
---
select * from `employee_shifts` where `id` = 1 limit 1
select exists(select * from `employee_shifts` where `id` = 1) as `exists`